<template>
  <div class="FeatureTester">
    <div class="TesterInner">
      <FeatureSetting :setting="setting" />
      <FeatureEditorPreview />
    </div>
  </div>
</template>

<script setup lang="ts">
//------------------------------------------------------------------------------------------------------------
// ページ設定・引数
//------------------------------------------------------------------------------------------------------------
interface Props {
  setting: any[]
}

const props = withDefaults(defineProps<Props>(), {})

const emit = defineEmits<{}>()

//------------------------------------------------------------------------------------------------------------
// 定数・変数（state）
//------------------------------------------------------------------------------------------------------------

//------------------------------------------------------------------------------------------------------------
// Function
//------------------------------------------------------------------------------------------------------------
</script>

<style lang="scss">
.FeatureTester {
  position: relative;
  height: 100%;
  width: 100%;

  .TesterInner {
    position: relative;
    height: 100%;
    width: 100%;
    display: flex;
  }
}
</style>
